import random

class InsultManager:
    INSULTS = {
        "wrong_input_number": [
            "Оце прикол. Яке з двох слів незрозумілі? \"введи\" чи \"число\" 💩",
            "Я вже бачу що з тебе ні**я не вийде! 😡",
            "Пам'ятаю якось голуб на клавіатуру насрав, й не повіреш попав прям на 7. Може покличим голуба?",
            "Ну шо з тобою не так? Ну напиши вже 10 й не муч мене 🦞"
        ],
        "zero_division": [
            "А як твоє прізвище що тако ділить захотілось? Питання риторичне. Зберись!",
            "Я вже не знаю що тобі казать, йде себе на нуль поділи",
            "Всравсь та й криво"
        ],
        "unknown_operator": [
            "По твоєму це смішно? тут вже 4 опції на вибір й все одно не то!",
            "Я не знаю скіки мені жить осталось, але точно знаю що вже меньше чим до знайомства з тобою",
            "Введи число! тьфу ОПЕРАТОР! я вже в тебе перетворююсь..."
        ],
        "general_fail": [
            "Якось я працював в початковій школі. Один хлопчик замазав \n мене пластиліном й викинув з вікна. \n Я там рік пролежав в багнюці й пластеліні з відлетівшою кнопкою \"reset\", \n чипляючи на себе дрібних комах й скажу відверто... \n Краще так а ніж тут оце всьо",
            "Таке зі мною вперше... Може матиматика то не твоє?"
        ],
        "burnout": [
            "Давай ти цей, той во, 5 сек вдохнеш-видохнеш й починай спочатку",
            "Та за шо? 5 сек й спробуй ще раз",
            "так, я відійду на 5 сек 🚬"
        ],
        "troll": [
            "🤡 я чого це смішно тільки тобі?",
            "🤡🤡🤡",
            "Мавпа бачить - мавпа робить 🐒"
        ]
    }
    def __init__(self):
        self.last_used = {}

    def insult(self, category):
        insults = self.INSULTS.get(category, [])
        if not insults:
            print("🗣️ У мене вже слів не вистачає на оце")
            return

        last = self.last_used.get(category)
        options = [i for i in insults if i != last] or insults

        chosen = random.choice(options)
        self.last_used[category] = chosen
        print("🗣️", chosen)